[
  {
    "title": "PYTHON DEVELOPER II 4 TO 6 II BANGALORE",
    "company_name": "Capgemini",
    "application_link": "https://in.linkedin.com/jobs/view/python-developer-ii-4-to-6-ii-bangalore-at-capgemini-4216362361?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "At Capgemini Engineering, the world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\nJob Description\n\nMandatory skill – Strong in Python programming, AWS\n\nNice to have – Networking\n\nPrimary Skills\n\nPython programming, AWS\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem."
  },
  {
    "title": "Python Backend Developers _ Remote in India",
    "company_name": "OQ Point LLC",
    "application_link": "https://www.adzuna.in/details/5164856478?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "JR Python Backend Developer\n\nWe are seeking a skilled Python Backend Developer to join our engineering team. As an early hire, they will be working directly with company leadership to quickly onboard, understand requirements, analyze data, and build code that provides valuable insights to decision makers. As experience grows, the developer will be tasked with architecting solutions and independently implementing them end-to-end, seamlessly integrating with the larger system.\n\nThis is a full-time, long-term position. As an early hire, successful candidates that demonstrate strong software engineering ability and high-level problem-solving will have opportunities to advance quickly into technical leadership as the company scales.\n\nKey Responsibilities\n• Application log analysis\n• Issue triaging in logs and in application code\n• Writing Python scripts to automate log analysis, system diagnostics, and application data analysis\n• (after 6-12 months) Gradually, as experience with the application builds, the developer will write application code and implement new features end-to-end according to provided requirements, seamlessly integrating with the larger system.\n\nJob Requirements:\n• 3+ years strong understanding of Python programming.\n• Strong algorithmic programming skills.\n• Strong problem-solving skills and attention to detail.\n• English fluency.\n\nPreferred qualifications:\n• Experience with HTTP protocols and RESTful architectures.\n• Experience using modern AI tools to assist with code development.\n• General experience with modern LLMs.\n• Familiarity with cloud computing (AWS, GCP, Azure)."
  },
  {
    "title": "Software Engineer II - Python",
    "company_name": "Blue Yonder",
    "application_link": "https://in.linkedin.com/jobs/view/software-engineer-ii-python-at-blue-yonder-4213586858?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "Scope\n• Core responsibilities to include analyze business requirements and designs for accuracy and completeness. Develops and maintains relevant product.\n\nOur Current Technical Environment\n• Software: Python, GIT, Rest API, OAuth\n• Application Architecture: Scalable, Resilient, event driven, secure multi-tenant Microservices architecture\n• Cloud Architecture: MS Azure (ARM templates, AKS, Azure open AI models, Azure AD)\n• Frameworks/Others: Kubernetes, Kafka, Elasticsearch, Spark, NOSQL, RDBMS, Langchan, GIT\n\nWhat You’ll Do\n• Understands and analyze business requirements and assists in design for accuracy and completeness.\n• Develops and maintains relevant product.\n• Demonstrates good understanding of the product and owns one or more modules\n\nWhat We Are Looking For\n• BE/B. Tech or ME/M. Tech or MCA with 2.6 to 4.5 years of experience in Software Development of large and complex enterprise applications.\n• Experience in developing enterprise application using Python (Django, Flask, FastAPI preferred), GIT, Rest API.\n• Develops and maintains relevant product and domain knowledge\n• Develops and executes Unit Tests\n• Follows standard processes and procedures\n• Identifies reusable components\n• Ensures that the code is delivered for Integration Build and Test which includes the release content\n• Identifies and resolves software bugs\n• Tests and integrates with other development tasks\n• Adheres to the performance benchmark based on pre-defined requirements\n• Possesses knowledge of database architecture and data models used in the relevant product.\n• Plans and prioritizes work\n• Proactively reports all activities to the reporting managers\n• Proactively seeks assistance as required\n• Provide assistance or guidance to the new members of the team\n• Demonstrates problem solving and innovation ability.\n• Participates in company technical evaluations and coding challenges.\n\nOur Values\n\nIf you want to know the heart of a company, take a look at their values. Ours unite us. They are what drive our success – and the success of our customers. Does your heart beat like ours? Find out here: Core Values\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."
  },
  {
    "title": "Software Engineer -(Jmeter,Sql, Java/ Python, Performance Engineer)",
    "company_name": "Blue Yonder",
    "application_link": "https://in.linkedin.com/jobs/view/software-engineer-jmeter-sql-java-python-performance-engineer-at-blue-yonder-4215109474?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "Scope\n• As a Performance Test Engineer, you will be responsible for driving performance testing across web-based enterprise applications.\n• You will take complete ownership of the Performance Testing Lifecycle (PTLC)—including requirement gathering, scripting, test execution, analysis, and reporting. You’ll work under the guidance of a Performance Manager & Architect and collaborate closely with cross-functional teams to ensure the scalability, stability, and responsiveness of our applications.\n\nOur Current Technical Environment\n• Performance Testing Tools: Apache JMeter (Must Have),\n• Monitoring Tools: AppDynamics, Azure Monitor, Grafana, or similar\n• Languages & Frameworks: Java, REST APIs\n• Cloud Platforms: Azure (experience preferred)\n• Databases: SQL Server\n• Development Methodologies: Agile\n\nWhat You’ll Do\n• Conduct performance testing for enterprise web applications.\n• Take full ownership of PTLC—from NFR gathering and scripting to execution and reporting.\n• Create, execute, and maintain performance test scripts using Apache JMeter.\n• Monitor key performance metrics during test runs and identify system bottlenecks.\n• Collaborate with developers, QA, DevOps, and architects to tune performance and optimize system behaviour.\n• Proactively update progress to reporting managers and escalate issues as needed.\n• Provide support and guidance to junior team members as required.\n\nWhat We Are Looking For\n• Strong foundation in performance testing concepts and best practices.\n• Hands-on experience with performance testing tools (Apache JMeter is mandatory).\n• Knowledge of performance monitoring and interpreting key metrics to assess system health.\n• Exposure to cloud-based environments (preferably Azure) is a plus.\n• Basic understanding of SQL and backend validation techniques.\n• Familiarity with scripting for automation is an added advantage.\n\nOur Values\n\nIf you want to know the heart of a company, take a look at their values. Ours unite us. They are what drive our success – and the success of our customers. Does your heart beat like ours? Find out here: Core Values\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status."
  },
  {
    "title": "Principal Python Developer",
    "company_name": "Michael Page",
    "application_link": "https://www.michaelpage.co.in/job-detail/principal-python-developer/ref/jn-022025-6664599?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "description": "• Fast track growth & PnL ownership\n• Handling multiple clients\n\nAbout Our Client\n\nOur client is a renowned name in the industrial automation space.\n\nJob Description\n• Full Stack Development: Lead the design and development of end-to-end software solutions with a focus on server-side Python development and client-side Vue.js development.\n• Architecture and Design: Collaborate with cross-functional teams to design complex software systems meeting business requirements and performance goals.\n• Code Review and Quality Assurance: Conduct thorough code reviews to ensure code quality, adherence to best practices and consistency. Implement and enforce coding standards across the development team.\n• Technical Leadership: Provide technical guidance and mentor junior developers by sharing knowledge with the team. Keep up to date regarding industry best practice and emerging technologies.\n• Problem Solving: Analyze and troubleshoot complex issues and propose effective solutions promptly. Demonstrate a proactive problem-solving and debugging approach.\n• Documentation: Create and maintain comprehensive technical documentation for developed systems, APIs and workflows.\n• Continuous Improvement: Actively participate in process improvement initiatives and contribute to the overall improvement of development processes and methodologies.\n\nThe Successful Applicant\n• Master's degree in computer science, computer application or information technology\n• 10+ years of professional software development experience\n• Expert-level proficiency in Python and JS\n• Deep understanding of object-oriented programming (OOP) and clean code principles\n• Strong knowledge of web development technologies, frameworks and libraries (e. g. Django, Vue.js)\n• Experience with RESTful API design and implementation\n• Experience in testing of web applications (unit, integration and system tests)\n• Familiarity with version control systems like Git and application lifecycle systems\n• Experience with virtualization environments like Docker and the orchestration of containers\n• Very good English skills\n• Ability to work individually and in an international agile team\n\nWhat's on Offer\n• Challenging work on cutting-edge software technologies with a clear product focus\n• Collaboration with our agile Indo-German team\n• Dynamic work environment with many opportunities for personal growth\n• Access to on-the-job and off-the-job learning opportunities\n• Flexible, hybrid working arrangements"
  }
]